In [101]:
import pandas as pd

In [102]:
''' 
Data cleaning:
when we have null values we have two options:

When we have numerical data -> use mean,median
When we have categorical data -> mode 


    Remove : df.dropna(axis=0/1, how='any'/'all', inplace='True'/'False') -> 0 : row and 1 : column  (by default its axis=0, how='any')
             df.drop(col_name, axis=0/1, inplace=True)

             any -> During axis=0 , if it finds any single null value in whole row it deletes it
             all -> During axis=0 , if its finds whole row null then only it deletes row

    Fill   : 
       we have mean,median,mode and custom way to fill null values


'''

" \nData cleaning:\nwhen we have null values we have two options:\n\nWhen we have numerical data -> use mean,median\nWhen we have categorical data -> mode \n\n\n    Remove : df.dropna(axis=0/1, how='any'/'all', inplace='True'/'False') -> 0 : row and 1 : column  (by default its axis=0, how='any')\n             df.drop(col_name, axis=0/1, inplace=True)\n\n             any -> During axis=0 , if it finds any single null value in whole row it deletes it\n             all -> During axis=0 , if its finds whole row null then only it deletes row\n\n    Fill   : \n       we have mean,median,mode and custom way to fill null values\n\n\n"

In [103]:
df = pd.read_csv('Employees.csv')
df.head(5)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0

In [104]:
df.dropna() # axis = 0 and how = any ,

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
45,145,John,Russell,JRUSSEL,011.44.1344.429268,01.10.2004,SA_MAN,14000,0.40,100.0,80.0
46,146,Karen,Partners,KPARTNER,011.44.1344.467268,05.01.2005,SA_MAN,13500,0.30,100.0,80.0
47,147,Alberto,Errazuriz,AERRAZUR,011.44.1344.429278,10.03.2005,SA_MAN,12000,0.30,100.0,80.0
48,148,Gerald,Cambrault,GCAMBRAU,011.44.1344.619268,15.10.2007,SA_MAN,11000,0.30,100.0,80.0
49,149,Eleni,Zlotkey,EZLOTKEY,011.44.1344.429018,29.01.2008,SA_MAN,10500,0.20,100.0,80.0
50,150,Peter,Tucker,PTUCKER,011.44.1344.129268,30.01.2005,SA_REP,10000,0.30,145.0,80.0
51,151,David,Bernstein,DBERNSTE,011.44.1344.345268,24.03.2005,SA_REP,9500,0.25,145.0,80.0
52,152,Peter,Hall,PHALL,011.44.1344.478968,20.08.2005,SA_REP,9000,0.25,145.0,80.0
53,153,Christopher,Olsen,COLSEN,011.44.1344.498718,30.03.2006,SA_REP,8000,0.20,145.0,80.0
54,154,Nanette,Cambrault,NCAMBRAU,011.44.1344.987668,09.12.2006,SA_REP,7500,0.20,145.0,80.0
55,155,Oliver,Tuvault,OTUVAULT,011.44.1344.486508,23.11.2007,SA_REP,7000,0.15,145.0,80.0
56,156,Janette,King,JKING,011.44.1345.429268,30.01.2004,SA_REP,10000,0.35,146.0,80.0
57,157,Patrick,Sully,PSULLY,011.44.1345.929268,04.03.2004,SA_REP,9500,0.35,146.0,80.0
58,158,Allan,McEwen,AMCEWEN,011.44.1345.829268,01.08.2004,SA_REP,9000,0.35,146.0,80.0
59,159,Lindsey,Smith,LSMITH,011.44.1345.729268,10.03.2005,SA_REP,8000,0.30,146.0,80.0
60,160,Louise,Doran,LDORAN,011.44.1345.629268,15.12.2005,SA_REP,7500,0.30,146.0,80.0
61,161,Sarath,Sewall,SSEWALL,011.44.1345.529268,03.11.2006,SA_REP,7000,0.25,146.0,80.0
62,162,Clara,Vishney,CVISHNEY,011.44.1346.129268,11.11.2005,SA_REP,10500,0.25,147.0,80.0
63,163,Danielle,Greene,DGREENE,011.44.1346.229268,19.03.2007,SA_REP,9500,0.15,147.0,80.0
64,164,Mattea,Marvins,MMARVINS,011.44.1346.329268,24.01.2008,SA_REP,7200,0.10,147.0,80.0
65,165,David,Lee,DLEE,011.44.1346.529268,23.02.2008,SA_REP,6800,0.10,147.0,80.0
66,166,Sundar,Ande,SANDE,011.44.1346.629268,24.03.2008,SA_REP,6400,0.10,147.0,80.0
67,167,Amit,Banda,ABANDA,011.44.1346.729268,21.04.2008,SA_REP,6200,0.10,147.0,80.0
68,168,Lisa,Ozer,LOZER,011.44.1343.929268,11.03.2005,SA_REP,11500,0.25,148.0,80.0
69,169,Harrison,Bloom,HBLOOM,011.44.1343.829268,23.03.2006,SA_REP,10000,0.20,148.0,80.0
70,170,Tayler,Fox,TFOX,011.44.1343.729268,24.01.2006,SA_REP,9600,0.20,148.0,80.0
71,171,William,Smith,WSMITH,011.44.1343.629268,23.02.2007,SA_REP,7400,0.15,148.0,80.0
72,172,Elizabeth,Bates,EBATES,011.44.1343.529268,24.03.2007,SA_REP,7300,0.15,148.0,80.0
73,173,Sundita,Kumar,SKUMAR,011.44.1343.329268,21.04.2008,SA_REP,6100,0.10,148.0,80.0
74,174,Ellen,Abel,EABEL,011.44.1644.429267,11.05.2004,SA_REP,11000,0.30,149.0,80.0
75,175,Alyssa,Hutton,AHUTTON,011.44.1644.429266,19.03.2005,SA_REP,8800,0.25,149.0,80.0
76,176,Jonathon,Taylor,JTAYLOR,011.44.1644.429265,24.03.2006,SA_REP,8600,0.20,149.0,80.0
77,177,Jack,Livingston,JLIVINGS,011.44.1644.429264,23.04.2006,SA_REP,8400,0.20,149.0,80.0
79,179,Charles,Johnson,CJOHNSON,011.44.1644.429262,04.01.2008,SA_REP,6200,0.10,149.0,80.0

In [105]:
df.head()
#its stil; showing commission null values becuase we didnt do inplave = true 
#Which means chanegs have been made but not saved in df 
#to save in df we need to do inplace = true

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0

In [106]:
#Dropping using inplace = True

# # df.dropna(axis=0, how='any', inplace=True)
# df.head(5)

In [107]:
#Its all about drop
# Now lets go into fill 
df.head()
#Fill commission using mean
commission_mean = df['COMMISSION_PCT'].mean()
print(f"commission_mean : {commission_mean:.2f}")

commission_mean : 0.22

In [108]:
df['COMMISSION_PCT'] = df['COMMISSION_PCT'].fillna(commission_mean)
df.head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,0.222857,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,0.222857,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,0.222857,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,0.222857,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,0.222857,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,0.222857,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,0.222857,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,0.222857,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,0.222857,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,0.222857,108.0,100.0

In [109]:
#Checking null values count in each column
df.isnull().sum()

EMPLOYEE_ID       0
FIRST_NAME        0
LAST_NAME         0
EMAIL             0
PHONE_NUMBER      0
HIRE_DATE         0
JOB_ID            0
SALARY            0
COMMISSION_PCT    0
MANAGER_ID        1
DEPARTMENT_ID     1
dtype: int64

In [110]:
manager_mode = df['MANAGER_ID'].mode()
print(f"Most occuring date : {manager_mode}")

Most occuring date : 0    100.0
Name: MANAGER_ID, dtype: float64

In [111]:
df['MANAGER_ID'] = df['MANAGER_ID'].fillna(manager_mode)
df.head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,0.222857,100.0,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,0.222857,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,0.222857,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,0.222857,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,0.222857,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,0.222857,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,0.222857,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,0.222857,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,0.222857,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,0.222857,108.0,100.0

In [112]:
df.isnull().sum()

EMPLOYEE_ID       0
FIRST_NAME        0
LAST_NAME         0
EMAIL             0
PHONE_NUMBER      0
HIRE_DATE         0
JOB_ID            0
SALARY            0
COMMISSION_PCT    0
MANAGER_ID        0
DEPARTMENT_ID     1
dtype: int64

In [113]:
depart_mode = df['DEPARTMENT_ID'].mode()[0]
print(f"{depart_mode}")

50.0

In [114]:
df['DEPARTMENT_ID'] = df['DEPARTMENT_ID'].fillna(depart_mode)[0]
df.head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,0.222857,100.0,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,0.222857,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,0.222857,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,0.222857,102.0,90.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,0.222857,103.0,90.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,0.222857,103.0,90.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,0.222857,103.0,90.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,0.222857,103.0,90.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,0.222857,101.0,90.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,0.222857,108.0,90.0

In [115]:
df.isnull().sum()

EMPLOYEE_ID       0
FIRST_NAME        0
LAST_NAME         0
EMAIL             0
PHONE_NUMBER      0
HIRE_DATE         0
JOB_ID            0
SALARY            0
COMMISSION_PCT    0
MANAGER_ID        0
DEPARTMENT_ID     0
dtype: int64

In [ ]:
#Manager id data is in float
#Change it to -> int

#Type casting : float -> int

df['MANAGER_ID'] = df['MANAGER_ID'].astype(int)

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     111 non-null    int64
 1   FIRST_NAME      111 non-null    object
 2   LAST_NAME       111 non-null    object
 3   EMAIL           111 non-null    object
 4   PHONE_NUMBER    111 non-null    object
 5   HIRE_DATE       111 non-null    object
 6   JOB_ID          111 non-null    object
 7   SALARY          111 non-null    int64
 8   COMMISSION_PCT  111 non-null    float64
 9   MANAGER_ID      111 non-null    int64
 10  DEPARTMENT_ID   111 non-null    float64
dtypes: float64(2), int64(3), object(6)
memory usage: 9.7+ KB